# Напишите несколько строк кода, выводящих на экран ваше имя и почтовый адрес.
# Адрес напишите в формате, принятом в вашей стране.

print('Финогеев Владислав Андреевич', 'Ул. Большая конная, 52, кв 6', 'Москва, Российская Федерация', '111111', sep='\n')
